// ----------------------------------------------------------------
// 這是超爛的演算法，看過就好
// ----------------------------------------------------------------
let unsorted = [14, -4, 17, 6, 22, 1, -5];

selectionSort(unsorted);

function selectionSort(arr) {
  // ----------------------------------------------------------------
  // 這是一個外層 for 迴圈，從數組的第一個元素開始，直到倒數第二個元素。
  // 這個迴圈用於選擇每次迭代中的“最小元素”。
  // ----------------------------------------------------------------
  for (let i = 0; i <= arr.length - 2; i++) {
    // ----------------------------------------------------------------
    // 初始化 minIndex 變數為當前迴圈的起始索引 i。這個變數用於追蹤每次迭代中最小元素的索引。
    // ----------------------------------------------------------------
    let minIndex = i;
    // ----------------------------------------------------------------
    // 這是一個內層 for 迴圈，從當前外層迴圈的索引開始，直到數組的最後一個元素。這個迴圈用於找出從 i 到數組結尾中最小的元素。
    // ----------------------------------------------------------------
    for (let j = i; j <= arr.length - 1; j++) {
      if (arr[j] < arr[minIndex]) {
        minIndex = j;
      }
    }
    // swap arr[minIndex] and arr[i]
    let temp = arr[minIndex];
    arr[minIndex] = arr[i];
    arr[i] = temp;
    console.log(arr);
  }

  console.log(arr);
  return arr;
}


